ЭкзаменационнаяЗадача/src/DataProcessors/ЗагрузкаКурсовВалютCBR/ЗагрузкаКурсовВалютCBR.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:DataProcessor>
  <name>ЗагрузкаКурсовВалютCBR</name>
  <attributes>
    <name>ДатаЗагрузки</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>Курсы</name>
    <attributes>
      <name>Наименование</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Код</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>10</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СимвольныйКод</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>10</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Курс</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>4</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Кратность</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>5</precision>
          <scale>1</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Валюта</name>
      <type>
        <types>CatalogRef.Валюты</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:DataProcessor>

ЭкзаменационнаяЗадача/src/InformationRegisters/КурсыВалют/КурсыВалют.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>КурсыВалют</name>
  <informationRegisterPeriodicity>Day</informationRegisterPeriodicity>
  <resources>
    <name>Курс</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>4</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>Кратность</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>1</scale>
      </numberQualifiers>
    </type>
  </resources>
  <attributes>
    <name>Пользователь</name>
    <type>
      <types>CatalogRef.Сотрудники</types>
    </type>
  </attributes>
  <dimensions>
    <name>Валюта</name>
    <type>
      <types>CatalogRef.Валюты</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

ЭкзаменационнаяЗадача/src/DataProcessors/ЗагрузкаКурсовВалютCBR/ObjectModule.bsl
#Область ПрограммныйИнтерфейс

// Получить курсы.
Процедура ПолучитьКурсы() Экспорт
	
	//1. получить прокси по статической ссылке
	WSПрокси = WSСсылки.cbrDailyInfo.СоздатьWSПрокси("http://web.cbr.ru/", "DailyInfo", "DailyInfoSoap");
	
	//2. Получить пакет XDTO, в котором описаны типы объектов
	ПакетXDTO = WSПрокси.ФабрикаXDTO.Пакеты.Получить("http://web.cbr.ru/");
	
	//3. Получить тип объекта XDTO, который используется для задания параметра операции веб-сервиса
	ТипGetCourseOnDate = ПакетXDTO.Получить("GetCursOnDate");
	
	//4. Создать ОбъектXTDO с типом параметра
	ПараметрВебСервиса = WSПрокси.ФабрикаXDTO.Создать(ТипGetCourseOnDate);
	ПараметрВебСервиса.On_date = ДатаЗагрузки;
	
	//5. Вызов метода веб-сервиса
	Результат = WSПрокси.GetCursOnDate(ПараметрВебСервиса);

	Если Результат = Неопределено Тогда

		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = "Не удалось получить курсы валют";
		Сообщение.Сообщить();
		Возврат;
	КонецЕсли;

	СписокВалют = Результат.GetCursOnDateResult.diffgram.ValuteData.ValuteCursOnDate;

	Курсы.Очистить();

	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	Валюты.Код КАК Код,
	|	Валюты.СимвольныйКод КАК СимвольныйКод,
	|	Валюты.Ссылка КАК Ссылка
	|ИЗ
	|	Справочник.Валюты КАК Валюты
	|ГДЕ
	|	НЕ Валюты.ПометкаУдаления";

	РезультатЗапроса = Запрос.Выполнить();

	ТаблицаВалют = РезультатЗапроса.Выгрузить();
	ТаблицаВалют.Индексы.Добавить("Код");

	Для Каждого ОбъектXDTO Из СписокВалют Цикл

		СтрокаКурса = Курсы.Добавить();
		СтрокаКурса.Наименование	= ОбъектXDTO.Vname;
		СтрокаКурса.Код				= ОбъектXDTO.Vcode;
		СтрокаКурса.СимвольныйКод	= ОбъектXDTO.VchCode;
		СтрокаКурса.Курс			= ОбъектXDTO.Vcurs;
		СтрокаКурса.Кратность		= ОбъектXDTO.Vnom;

		НайденнаяСтрока = ТаблицаВалют.Найти(СтрокаКурса.Код, "Код");
		Если НайденнаяСтрока <> Неопределено Тогда

			СтрокаКурса.Валюта = НайденнаяСтрока.Ссылка;
		КонецЕсли;
	КонецЦикла;

КонецПроцедуры

Процедура ЗаписатьКурсы() Экспорт

	Для Каждого СтрокаКурса Из Курсы Цикл

		Если СтрокаКурса.Валюта.Пустая() Тогда

			Продолжить;
		КонецЕсли;

		Запись 				= РегистрыСведений.КурсыВалют.СоздатьМенеджерЗаписи();
		Запись.Период	 	= ДатаЗагрузки;
		Запись.Валюта	 	= СтрокаКурса.Валюта;
		Запись.Курс		 	= СтрокаКурса.Курс;
		Запись.Кратность 	= СтрокаКурса.Кратность;
		Запись.Пользователь = ПолучениеДанныхТекущегоСеансаСервер.ВернутьЗначениеПараметраСеансаТекущийПользователь();

		Запись.Записать();
	КонецЦикла;

КонецПроцедуры

#КонецОбласти
